/**
 *
 * Project_name: a-datav
 * Company: aleiye
 * Author: yulucui
 * Date: Created in 2020/11/15.
 * Description:
 * Modified By:
 */
const seriesColors = {
    "default": {
        name: '默认',
        value: ['rgba(10,115,255,1)', 'rgba(61,171,255,1)', 'rgba(87,205,255,1)', 'rgba(112,222,255,1)', 'rgba(163,246,255,1)', 'rgba(189,253,255,1)', 'rgba(214,255,254,1)']
    },
    "blue": {
        name: '科技蓝',
        value: ["rgb(133, 165, 255)", "rgb(89, 126, 247)", "rgb(47, 84, 235)", "rgb(29, 57, 196)", "rgb(16, 35, 158)", "rgb(6, 17, 120)", "rgb(3, 8, 82)"]
    },
    "green": {
        name: '炫酷绿',
        value: ["rgb(92, 219, 211)", "rgb(54, 207, 201)", "rgb(19, 194, 194)", "rgb(8, 151, 156)", "rgb(0, 109, 117)", "rgb(0, 71, 79)", "rgb(0, 35, 41)"]
    },
    "violet": {
        name: '炫酷紫',
        value: ["rgb(179, 127, 235)", "rgb(146, 84, 222)", "rgb(114, 46, 209)", "rgb(83, 29, 171)", "rgb(57, 16, 133)", "rgb(34, 7, 94)", "rgb(18, 3, 56)"]
    },
    "orange": {
        name: '活力橙',
        value: ["rgb(255, 192, 105)", "rgb(255, 169, 64)", "rgb(250, 140, 22)", "rgb(212, 107, 8)", "rgb(173, 78, 0)", "rgb(135, 56, 0)", "rgb(97, 37, 0)"]
    },
    "gray_green": {
        name: '灰绿',
        value: ["rgb(212, 210, 197)", "rgb(118, 116, 93)", "rgb(165, 188, 136)", "rgb(127, 139, 74)", "rgb(80, 101, 66)", "rgb(113, 144, 119)", "rgb(143, 145, 140)"]
    },
    "genial": {
        name: '和煦',
        value: ["rgb(165, 58, 76)", "rgb(174, 161, 144)", "rgb(219, 189, 150)", "rgb(165, 58, 76)", "rgb(174, 161, 144)", "rgb(54, 52, 57)", "rgb(245, 213, 192)"]
    },
    "clear": {
        name: '清澈',
        value: ["rgb(214, 231, 238)", "rgb(151, 202, 219)", "rgb(1, 138, 190)", "rgb(2, 69, 122)", "rgb(88, 137, 152)", "rgb(83, 182, 195)", "rgb(3, 26, 68)"]
    },
    "bright": {
        name: '明彩',
        value: ["rgb(59, 130, 130)", "rgb(246, 100, 75)", "rgb(213, 195, 181)", "rgb(51, 111, 145)", "rgb(237, 48, 60)", "rgb(254, 157, 89)", "rgb(251, 209, 138)"]
    },
    "empty": {
        name: '无',
        value: []
    },
}
export default seriesColors